<script setup lang="ts"></script>

<template>
  <article class="w-full h-full flex flex-col">
    <h1 class="text-4xl text-center">國立陽明交通大學資訊技術服務中心</h1>
    <h1 class="text-4xl mt-4 text-center">DNS 網域伺服器維運服務管理要點</h1>
    <p class="text-right text-gray-500">113 年 6 月 11 日資訊技術服務中心主管會議通過</p>

    <main class="px-12 py-4 text-lg">
      <ol class="space-y-2">
        <li>一、為有效管理國立陽明交通大學(以下簡稱本校)DNS 網域伺服器維運服務，特訂定本要點。</li>
        <li>二、目的：DNS 網域伺服器為提供本校行政、教學、研究用途使用。</li>
        <li>
          三、特色：
          <ol class="pl-8">
            <li>
              (一)提供本校所屬網域 nycu.edu.tw 之正向解析與本校所屬網段之反向解析，以利各
              項代表本校的網路服務建置使用。
            </li>
            <li>
              (二)正向解析可申請單一網域名稱或子網域自行管理，後者可自行使用本中心提供的管
              理介面管理，或申請指向自行建置的網域權威伺服器。
            </li>
            <li>
              (三)具有完整的 DNSSEC 支援，於申請子網域自行管理時亦有同樣的要求，以確保所屬網
              域的信任度。
            </li>
            <li>(四)系統架構通過相關資安稽核，所有 DNS 查詢行為與變更動作均做紀錄。</li>
          </ol>
        </li>
        <li>
          四、申請規定：
          <ol class="pl-8">
            <li>
              (一)申請對象：本校編制內單位及經校務會議通過之一、二級行政、教學、研究單位及專任教師。
            </li>
            <li>
              (二)申請方式：至本中心網頁下載「DNS
              網域伺服器維運服務申請表」，並詳細填寫申請表之各欄位資料，經一、二級單位主管簽核後，送至本中心服務櫃台辦理。
            </li>
            <li>
              (三)以每年 1 月 1
              日為新一年度的服務開始，按年收費；一旦申請後，將無法退費，並應於服務起始日三天前完成繳費；首次申請未滿一整年者，則依比例計費。若於
              1 月 1 日啟用申請者，請於一週前完成申請，並於 1 月 30 日前完成繳費。
            </li>
            <li>(四)本服務收費標準依「資訊技術服務中心資訊服務收入管理要點」辦理。</li>
            <li>
              (五)若未於期限內續提出申請並完成繳費者，將於當年度 1 月 31 日刪除該帳號 DNS 服務網域。
            </li>
          </ol>
        </li>
        <li>
          五、使用規範
          <ol class="pl-8">
            <li>
              (一)本服務僅作為校園行政、學術及研究用途，不得從事營利性商業用途，且須符合資通安全管理法及智慧財產權相關規定。如網站遭遇重大資訊安全事件或違反上述規定情節重大者，本中心得立即暫時停止該帳號服務。
            </li>
            <li>
              (二)本服務之使用應遵守「國立陽明交通大學網域管理規範」及「國立陽明交通大學校園網路使用規範」之規範。
            </li>
            <li>
              (三)其他事項請參考「資通安全管理法」、「個人資料保護法」、「政府資訊公開法」、政府機關及本校相關資訊安全管理規範。
            </li>
          </ol>
        </li>
        <li>六、本要點經資訊技術服務中心主管會議通過後實施，修正時亦同。</li>
      </ol>
    </main>
  </article>
</template>
